ir_version: 4
producer_name: "pytorch"
producer_version: "1.3"
graph {
  node {
    input: "in"
    input: "conv2.weight"
    input: "conv2.bias"
    output: "5"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "5"
    output: "ooo"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 128
    data_type: 1
    name: "conv1.bias"
    raw_data: "..."
  }
  initializer {
    dims: 128
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "conv1.weight"
    raw_data: "..."
  }
  initializer {
    dims: 2
    data_type: 1
    name: "conv2.bias"
    raw_data: "k\375$>\355\0020>"
  }
  initializer {
    dims: 2
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "conv2.weight"
    raw_data: "..."
  }
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  output {
    name: "ooo"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 126
          }
          dim {
            dim_value: 126
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
