ir_version: 4
producer_name: "pytorch"
producer_version: "1.3"
graph {
  node {
    input: "in"
    input: "grid"
    output: "ooo"
    op_type: "ATen"
    attribute {
      name: "align_corners"
      i: 0
      type: INT
    }
    attribute {
      name: "interpolation_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "operator"
      s: "grid_sampler"
      type: STRING
    }
    attribute {
      name: "padding_mode"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "in"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 50
          }
        }
      }
    }
  }
  input {
    name: "grid"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "ooo"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
